In [78]:
# !pip install pandas
import numpy as np
import pandas as pd

In [37]:
user_defined = {
    'Marks_A':np.random.randint(50,100,9),
    'Marks_B':np.random.randint(50,100, 9),
    'Marks_C':np.random.randint(50,100, 9),
    'Marks_D':np.random.randint(50,100, 9)
}

In [79]:
user_defined

{'Marks_A': array([62, 91, 64, 69, 64, 70, 77, 71, 85]),
 'Marks_B': array([80, 76, 55, 78, 75, 52, 77, 97, 71]),
 'Marks_C': array([73, 78, 54, 99, 93, 72, 62, 58, 89]),
 'Marks_D': array([62, 67, 69, 66, 78, 70, 91, 77, 62])}

In [39]:
df = pd.DataFrame(user_defined, dtype = int)

In [40]:
type(df)

pandas.core.frame.DataFrame

In [41]:
df

   Marks_A  Marks_B  Marks_C  Marks_D
0       62       80       73       62
1       91       76       78       67
2       64       55       54       69
3       69       78       99       66
4       64       75       93       78
5       70       52       72       70
6       77       77       62       91
7       71       97       58       77
8       85       71       89       62

In [42]:
df.shape

(9, 4)

In [43]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Marks_A  9 non-null      int32
 1   Marks_B  9 non-null      int32
 2   Marks_C  9 non-null      int32
 3   Marks_D  9 non-null      int32
dtypes: int32(4)
memory usage: 276.0 bytes

In [44]:
df.describe()

         Marks_A    Marks_B    Marks_C    Marks_D
count   9.000000   9.000000   9.000000   9.000000
mean   72.555556  73.444444  75.333333  71.333333
std     9.963823  13.445363  15.874508   9.300538
min    62.000000  52.000000  54.000000  62.000000
25%    64.000000  71.000000  62.000000  66.000000
50%    70.000000  76.000000  73.000000  69.000000
75%    77.000000  78.000000  89.000000  77.000000
max    91.000000  97.000000  99.000000  91.000000

In [45]:
my_data = df.to_csv('Marks.csv')

In [46]:
data = pd.read_csv('Marks.csv')

In [47]:
data

   Unnamed: 0  Marks_A  Marks_B  Marks_C  Marks_D
0           0       62       80       73       62
1           1       91       76       78       67
2           2       64       55       54       69
3           3       69       78       99       66
4           4       64       75       93       78
5           5       70       52       72       70
6           6       77       77       62       91
7           7       71       97       58       77
8           8       85       71       89       62

In [48]:
data = data.drop(columns = ['Unnamed: 0'])

In [49]:
data

   Marks_A  Marks_B  Marks_C  Marks_D
0       62       80       73       62
1       91       76       78       67
2       64       55       54       69
3       69       78       99       66
4       64       75       93       78
5       70       52       72       70
6       77       77       62       91
7       71       97       58       77
8       85       71       89       62

In [50]:
df.isnull().sum()

Marks_A    0
Marks_B    0
Marks_C    0
Marks_D    0
dtype: int64

In [51]:
df.columns

Index(['Marks_A', 'Marks_B', 'Marks_C', 'Marks_D'], dtype='object')

In [52]:
df.head()

   Marks_A  Marks_B  Marks_C  Marks_D
0       62       80       73       62
1       91       76       78       67
2       64       55       54       69
3       69       78       99       66
4       64       75       93       78

In [53]:
df.shape

(9, 4)

In [54]:
df.iloc[:]

   Marks_A  Marks_B  Marks_C  Marks_D
0       62       80       73       62
1       91       76       78       67
2       64       55       54       69
3       69       78       99       66
4       64       75       93       78
5       70       52       72       70
6       77       77       62       91
7       71       97       58       77
8       85       71       89       62

In [55]:
df.iloc[2:4]

   Marks_A  Marks_B  Marks_C  Marks_D
2       64       55       54       69
3       69       78       99       66

In [56]:
df.iloc[1:5, 1]

1    76
2    55
3    78
4    75
Name: Marks_B, dtype: int32

In [57]:
df.iloc[:6,:9]

   Marks_A  Marks_B  Marks_C  Marks_D
0       62       80       73       62
1       91       76       78       67
2       64       55       54       69
3       69       78       99       66
4       64       75       93       78
5       70       52       72       70

In [58]:
df

   Marks_A  Marks_B  Marks_C  Marks_D
0       62       80       73       62
1       91       76       78       67
2       64       55       54       69
3       69       78       99       66
4       64       75       93       78
5       70       52       72       70
6       77       77       62       91
7       71       97       58       77
8       85       71       89       62

In [59]:
df.columns.get_loc('Marks_A')

0

In [60]:
df.columns.get_loc('Marks_B')

1

In [61]:
df.columns

Index(['Marks_A', 'Marks_B', 'Marks_C', 'Marks_D'], dtype='object')

In [64]:
idx = [df.columns.get_loc('Marks_A'),df.columns.get_loc("Marks_C")]

In [65]:
df.iloc[:,[0,2]]

   Marks_A  Marks_C
0       62       73
1       91       78
2       64       54
3       69       99
4       64       93
5       70       72
6       77       62
7       71       58
8       85       89

In [66]:
df.head()

   Marks_A  Marks_B  Marks_C  Marks_D
0       62       80       73       62
1       91       76       78       67
2       64       55       54       69
3       69       78       99       66
4       64       75       93       78

In [67]:
df.sort_values(by = ['Marks_B'])

   Marks_A  Marks_B  Marks_C  Marks_D
5       70       52       72       70
2       64       55       54       69
8       85       71       89       62
4       64       75       93       78
1       91       76       78       67
6       77       77       62       91
3       69       78       99       66
0       62       80       73       62
7       71       97       58       77

In [68]:
# df.sort_values(by = ['Marks_A'])

In [69]:
data = df.values

In [70]:
data

array([[62, 80, 73, 62],
       [91, 76, 78, 67],
       [64, 55, 54, 69],
       [69, 78, 99, 66],
       [64, 75, 93, 78],
       [70, 52, 72, 70],
       [77, 77, 62, 91],
       [71, 97, 58, 77],
       [85, 71, 89, 62]])

In [71]:
df = pd.DataFrame(data, dtype = 'float', columns = ['Marks_A', "Marks_B", "Marks_C", "Marks_D"])

In [72]:
df.head()

   Marks_A  Marks_B  Marks_C  Marks_D
0     62.0     80.0     73.0     62.0
1     91.0     76.0     78.0     67.0
2     64.0     55.0     54.0     69.0
3     69.0     78.0     99.0     66.0
4     64.0     75.0     93.0     78.0

In [73]:
data.iloc[:2]

AttributeError: 'numpy.ndarray' object has no attribute 'iloc'

In [74]:
data.iloc[1:7,3]

AttributeError: 'numpy.ndarray' object has no attribute 'iloc'

In [75]:
data.iloc[1:7,1:3]

AttributeError: 'numpy.ndarray' object has no attribute 'iloc'

In [76]:
data.columns

AttributeError: 'numpy.ndarray' object has no attribute 'columns'

In [77]:
data.columns.get_loc('Marks_C')

AttributeError: 'numpy.ndarray' object has no attribute 'columns'

In [ ]:
idx = [data.columns.get_loc('Marks_c'),data.columns.get_loc('Marks_B')]

In [ ]:
idx

In [ ]:
data.iloc[3, idx]

In [ ]:
data

In [ ]:
data.sort_values(by = ['Marks_B'])

In [ ]:
data.sort_values(by = ['Marks_B','Marks_A'])

In [ ]:
data = data.values

In [ ]:
data

In [ ]:
df = pd.DataFrame(data, dtype = 'float64')

In [ ]:
df

In [ ]:
Data = pd.read_csv('Titanic-Dataset.csv')

In [ ]:
Data.head()

In [ ]:
Data.isnull().sum()

In [ ]:
Data = Data.drop(columns = ['PassengerId', 'Name', 'Ticket','Cabin'])

In [ ]:
Data

In [ ]:
Data.isnull().sum()

In [ ]:
median = Data['Age'].median()
mean = Data['Age'].mean()
Max = Data['Embarked'].value_counts().idxmax()
Max

In [ ]:
Data['Age'] = Data['Age'].fillna(median)
Data['Embarked'] = Data['Embarked'].fillna(Max)

In [ ]:
Data.isnull().sum()

In [ ]:
Data.describe()

In [ ]:
Data

In [ ]:
Data['Age'] = Data['Age'].fillna(median)
Data['Embarked'] = Data['Embarked'].fillna(Max)

In [ ]:
Data.isnull().sum()

In [ ]:
Data.describe()

In [ ]:
Max

In [ ]:
# mean = df['Age'].mean(skipna = True)
# median = df["Age"].median(skipna = True)
# max = df['Embarked'].value_counts().idxmax()
Data

In [ ]:
# Data = pd.get_dummies(Data, columns = ['Embarked', 'Sex'])
Data['Embarked'].unique()

In [ ]:
Data = pd.get_dummies(Data, columns = ['Embarked', 'Sex'])

In [ ]:
Data.head(2)

In [ ]:
# Data['Company'] = np.where((Data['SibSp'] + Data['Parch'] > 0 ),1 ,0 )

In [ ]:
# Data.isnull().sum()

In [ ]:
# Data = Data.drop(columns = ['SibSp', 'Parch'])

# Now convert these catoegorical data to numerical values

In [ ]:
Data['Embarked_C'] = np.where((Data['Embarked_C'] == True), 1, 0)
Data['Embarked_Q'] = np.where((Data['Embarked_Q'] == True), 1, 0)
Data['Embarked_S'] = np.where((Data['Embarked_S'] == True), 1, 0)
Data['Sex_male'] = np.where((Data['Sex_male'] == True), 1, 0)
Data['Sex_female'] = np.where((Data['Sex_female'] == True), 1, 0)

In [ ]:
Data.head(8)

In [ ]:
Data.isnull().sum()

In [ ]:
train.head(8)